In [21]:
from my_functions import *
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [22]:
def new_student(x):
    """
    
    Creates an array of features for a new student. 
    
    Parameters:
        x (pandas dataframe): Shape(m,n) Training set to the model. Defines the features for a new student
        
    Returns:
        new (pandas dataframe): 
    """
    
    new_data = {}
    for column in x.columns:
        if x[column].dtype == "object":
            inp = input("Please write the " + column + " of a student (" + str(x[column].unique()) + "): ")
            while inp not in x[column].unique():
                print("Invalid feature! Please try again!")
                inp = input("Please write the " + column + " of a student (" + str(x[column].unique()) + "): ")
                
        elif column == "age":
            while True:
                try:
                    inp = int(input("Please write the " + column +" of a student (from " + str(15) + " to " + str(25) + "): "))
                    while inp < 15 or inp > 25:
                        print("Invalid feature! Please try again!")
                        inp = int(input("Please write the " + column +" of a student (from " + str(15) + " to " + str(25) + "): "))
                except ValueError: 
                    print("Value Error for age! Please try again!")
                    continue
                
                if inp >= 15 or inp <= 25:
                    break
        
        
        elif column == "G1" or column == "G2":
            while True:
                try:
                    inp = int(input("Please write the " + column +" of a student (from " + str(0) + " to " + str(20) + "): "))
                    while inp < 0 or inp > 20:
                        print("Invalid grade! Please try again!")
                        inp = int(input("Please write the " + column +" of a student (from " + str(0) + " to " + str(20) + "): "))
                except ValueError:
                    print("Value Error for grade! Please try again!")
                    continue
                if inp >= 0 or inp <= 20:
                    break
                    
                    
        new_data[column] = inp
    
    new = pd.DataFrame(new_data, index=[0])
        
        
            
            
        
        
        
    return new

In [23]:
x, y = load_data("data/student-mat.csv")
x

    school sex  age      Mjob      Fjob higher activities  G1  G2
0       GP   F   18   at_home   teacher    yes         no   5   6
1       GP   F   17   at_home     other    yes         no   5   5
2       GP   F   15   at_home     other    yes         no   7   8
3       GP   F   15    health  services    yes        yes  15  14
4       GP   F   16     other     other    yes         no   6  10
..     ...  ..  ...       ...       ...    ...        ...  ..  ..
390     MS   M   20  services  services    yes         no   9   9
391     MS   M   17  services  services    yes         no  14  16
392     MS   M   21     other     other    yes         no  10   8
393     MS   M   18  services     other    yes         no  11  12
394     MS   M   19     other   at_home    yes         no   8   9

[395 rows x 9 columns]

In [24]:
x["school"].unique()

array(['GP', 'MS'], dtype=object)

In [25]:
new_student = new_student(x)

Please write the school of a student (['GP' 'MS']): GP
Please write the sex of a student (['F' 'M']): F
Please write the age of a student (from 15 to 25): 25
Please write the Mjob of a student (['at_home' 'health' 'other' 'services' 'teacher']): at_home
Please write the Fjob of a student (['teacher' 'other' 'services' 'health' 'at_home']): health
Please write the higher of a student (['yes' 'no']): yes
Please write the activities of a student (['no' 'yes']): yes
Please write the G1 of a student (from 0 to 20): 20
Please write the G2 of a student (from 0 to 20): 20

In [26]:
new_student

  school sex  age     Mjob    Fjob higher activities  G1  G2
0     GP   F   25  at_home  health    yes        yes  20  20

In [8]:
new_student

  school sex  age     Mjob     Fjob higher activities  G1  G2
0     GP   M   15  at_home  at_home    yes        yes  20  20

In [9]:
x

    school sex  age      Mjob      Fjob higher activities  G1  G2
0       GP   F   18   at_home   teacher    yes         no   5   6
1       GP   F   17   at_home     other    yes         no   5   5
2       GP   F   15   at_home     other    yes         no   7   8
3       GP   F   15    health  services    yes        yes  15  14
4       GP   F   16     other     other    yes         no   6  10
..     ...  ..  ...       ...       ...    ...        ...  ..  ..
390     MS   M   20  services  services    yes         no   9   9
391     MS   M   17  services  services    yes         no  14  16
392     MS   M   21     other     other    yes         no  10   8
393     MS   M   18  services     other    yes         no  11  12
394     MS   M   19     other   at_home    yes         no   8   9

[395 rows x 9 columns]

In [10]:
x_new = x.append(new_student)
x_new

    school sex  age      Mjob      Fjob higher activities  G1  G2
0       GP   F   18   at_home   teacher    yes         no   5   6
1       GP   F   17   at_home     other    yes         no   5   5
2       GP   F   15   at_home     other    yes         no   7   8
3       GP   F   15    health  services    yes        yes  15  14
4       GP   F   16     other     other    yes         no   6  10
..     ...  ..  ...       ...       ...    ...        ...  ..  ..
391     MS   M   17  services  services    yes         no  14  16
392     MS   M   21     other     other    yes         no  10   8
393     MS   M   18  services     other    yes         no  11  12
394     MS   M   19     other   at_home    yes         no   8   9
0       GP   M   15   at_home   at_home    yes        yes  20  20

[396 rows x 9 columns]

In [11]:
x_new.iloc[-1]

school             GP
sex                 M
age                15
Mjob          at_home
Fjob          at_home
higher            yes
activities        yes
G1                 20
G2                 20
Name: 0, dtype: object

In [12]:
dummy_matrices(x_new)

C:\Users\Admin\Desktop\Project\my_functions.py:61: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  non_num[column] = non_num[column].apply(lambda x: column[0].lower() + "_" + x)

,school,sex,age,higher,activities,G1,G2,m_at_home,m_health,m_other,m_services,f_at_home,f_health,f_other,f_services
0,0,0,18,1,0,5,6,1,0,0,0,0,0,0,0
1,0,0,17,1,0,5,5,1,0,0,0,0,0,1,0
2,0,0,15,1,0,7,8,1,0,0,0,0,0,1,0
3,0,0,15,1,1,15,14,0,1,0,0,0,0,0,1
4,0,0,16,1,0,6,10,0,0,1,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
391,1,1,17,1,0,14,16,0,0,0,1,0,0,0,1
392,1,1,21,1,0,10,8,0,0,1,0,0,0,1,0
393,1,1,18,1,0,11,12,0,0,0,1,0,0,1,0
394,1,1,19,1,0,8,9,0,0,1,0,1,0,0,0
0,0,1,15,1,1,20,20,1,0,0,0,1,0,0,0

In [13]:
dummy_matrices(x_new).iloc[-1]

C:\Users\Admin\Desktop\Project\my_functions.py:61: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  non_num[column] = non_num[column].apply(lambda x: column[0].lower() + "_" + x)

school         0
sex            1
age           15
higher         1
activities     1
G1            20
G2            20
m_at_home      1
m_health       0
m_other        0
m_services     0
f_at_home      1
f_health       0
f_other        0
f_services     0
Name: 0, dtype: int64

In [14]:
def dummy_matrix_of_new_student(new_student, x):
    x_new = x.append(new_student)
    new_dummy = dummy_matrices(x_new)
    new_student_dummy = new_dummy.iloc[-1]
    
    return new_student_dummy

In [27]:
dummy_matrix_of_new_student(new_student, x)

C:\Users\Admin\Desktop\Project\my_functions.py:61: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  non_num[column] = non_num[column].apply(lambda x: column[0].lower() + "_" + x)

school         0
sex            0
age           25
higher         1
activities     1
G1            20
G2            20
m_at_home      1
m_health       0
m_other        0
m_services     0
f_at_home      0
f_health       1
f_other        0
f_services     0
Name: 0, dtype: int64

In [18]:
dummy_matrix_of_new_student(new_student, x)

school         0
sex            1
age           15
higher         1
activities     1
G1            20
G2            20
m_at_home      1
m_health       0
m_other        0
m_services     0
f_at_home      1
f_health       0
f_other        0
f_services     0
Name: 0, dtype: int64

In [21]:
x.append(new_student)

    school sex  age      Mjob      Fjob higher activities  G1  G2
0       GP   F   18   at_home   teacher    yes         no   5   6
1       GP   F   17   at_home     other    yes         no   5   5
2       GP   F   15   at_home     other    yes         no   7   8
3       GP   F   15    health  services    yes        yes  15  14
4       GP   F   16     other     other    yes         no   6  10
..     ...  ..  ...       ...       ...    ...        ...  ..  ..
391     MS   M   17  services  services    yes         no  14  16
392     MS   M   21     other     other    yes         no  10   8
393     MS   M   18  services     other    yes         no  11  12
394     MS   M   19     other   at_home    yes         no   8   9
0       GP   M   25   teacher   teacher    yes        yes  20  20

[396 rows x 9 columns]

In [22]:
    new_dummy = dummy_matrices(x_new)
    new_student_dummy = new_dummy.iloc[-1]

C:\Users\Admin\Desktop\Project\my_functions.py:61: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  non_num[column] = non_num[column].apply(lambda x: column[0].lower() + "_" + x)

In [23]:
new_student_dummy

school         0
sex            1
age           25
higher         1
activities     1
G1            20
G2            20
m_at_home      0
m_health       0
m_other        0
m_services     0
f_at_home      0
f_health       0
f_other        0
f_services     0
Name: 0, dtype: int64